app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'R') ORDER BY release_date
---
  def index
    if params[:commit] == 'Refresh'
      session[:ratings] = params[:ratings]
    elsif session[:ratings] != params[:ratings]
      redirect = true
      params[:ratings] = session[:ratings]
    end

    if params[:sort]
      session[:sort] = params[:sort]
    elsif session[:sort]
      redirect = true
      params[:sort] = session[:sort]
    end

    @ratings, @sort = session[:ratings], session[:sort]
    if redirect
      redirect_to movies_path({:sort=>@sort, :ratings=>@ratings})
    elsif
      columns = {'title'=>'title', 'release_date'=>'release_date'} # hash
      if columns.has_key?(@sort) # returns true if the given key is present in hsh
        query = Movie.order(columns[@sort])